/*
===============================================================================
Проверка качества данных
===============================================================================
Назначение скрипта:
    Этот скрипт выполняет проверки качества для валидации целостности, 
    согласованности и точности данных на уровне gold. Проверки гарантируют:
    - Уникальность суррогатных ключей в таблицах измерений.
    - Сохранение ссылочной целостности между фактами и измерениями.
    - Корректность связей в модели данных для аналитических задач.

Примечания по использованию:
    - При обнаружении несоответствий необходимо их проанализировать и устранить.
===============================================================================
*/

-- ====================================================================
-- Проверка 'gold.dim_customers'
-- ====================================================================
-- Проверка уникальности customer_key в gold.dim_customers
-- Ожидание: результатов быть не должно
select 
    customer_key,
    count(*) as duplicate_count
from gold.dim_customers
group by customer_key
having count(*) > 1;

-- ====================================================================
-- Проверка 'gold.dim_products'
-- ====================================================================
-- Проверка уникальности product_key в gold.dim_products
-- Ожидание: результатов быть не должно
select 
    product_key,
    count(*) as duplicate_count
from gold.dim_products
group by product_key
having count(*) > 1;

-- ====================================================================
-- Проверка 'gold.fact_sales'
-- ====================================================================
-- Проверка связности модели данных между фактами и измерениями
select * 
from gold.fact_sales f
left join gold.dim_customers c
    on c.customer_key = f.customer_key
left join gold.dim_products p
    on p.product_key = f.product_key
where p.product_key is null 
   or c.customer_key is null;
